In [127]:
import mysql.connector

connection = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "Pooja@123",
    auth_plugin = 'mysql_native_password'
)


print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x11efde0c0>

In [79]:
cursorObject = connection.cursor()
cursorObject.execute("CREATE DATABASE e_commerce")

In [129]:
connection = mysql.connector.connect(host='localhost',
                                    user = 'root',
                                    passwd = 'Pooja@123',
                                   database = 'e_commerce',
                                   auth_plugin='mysql_native_password')

cursorObject = connection.cursor()

In [83]:
table_creation_query = """create table customer(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID));

                            CREATE TABLE category(CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID));
                            
                            CREATE TABLE supplier(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10));
                            
                            CREATE TABLE product(PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));
                            
                          CREATE TABLE product_details(PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
                          PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));
                          
                          CREATE TABLE order(ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));
                          
                          CREATE TABLE rating(RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID));"""
cursorObject.execute(table_creation_query)

In [85]:
connection.close()

In [89]:
# insert into "supplier" table
## Inserting Values into "supplier" table

insert_query = """INSERT INTO supplier (SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES (%s, %s, %s, %s)"""
val = [(1,"Rajesh Retails","Delhi",'1234567890'),
       (2,"Appario Ltd.","Mumbai",'2589631470'),
       (3,"Knome products","Banglore",'9785462315'),
       (4,"Bansal Retails","Kochi",'8975463285'),
       (5,"Mittal Ltd.","Lucknow",'7898456532')]

cursorObject.executemany(insert_query,val)
connection.commit()

In [91]:
insert_query = "INSERT INTO category (CAT_ID, CAT_NAME) VALUES (%s, %s)"
val = [(1,"BOOKS"),
       (2,"GAMES"),
       (3,"GROCERIES"),
       (4,"ELECTRONICS"),
       (5,"CLOTHES")]


cursorObject.executemany(insert_query, val)
connection.commit()

In [ ]:
insert_query = "INSERT INTO product (PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) VALUES (%s, %s, %s, %s)"
val = [(1,"GTA V","DFJDJFDJFDJFDJFJF",2),
       (2,"TSHIRT","DFDFJDFJDKFD",5),
       (3,"ROG LAPTOP","DFNTTNTNTERND",4),
       (4,"OATS","REURENTBTOTH",3),
       (5,"HARRY POTTER","NBEMCTHTJTH",1)]


cursorObject.executemany(insert_query, val)
connection.commit()

In [103]:
insert_query = "INSERT INTO product_details (PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE) VALUES (%s, %s, %s, %s)"
val = [(1,1,2,1500),
       (2,3,5,30000),
       (3,5,1,3000),
       (4,2,3,2500),
       (5,4,1,1000)]


cursorObject.executemany(insert_query, val)
connection.commit()

In [111]:
create_query = """CREATE TABLE orders (`ORD_ID` INT NOT NULL,`ORD_AMOUNT` INT NOT NULL,`ORD_DATE` DATE,
                    `CUS_ID` INT NOT NULL,`PROD_ID` INT NOT NULL, PRIMARY KEY (`ORD_ID`),
                    FOREIGN KEY (`CUS_ID`) REFERENCES CUSTOMER(`CUS_ID`),
                    FOREIGN KEY (`PROD_ID`) REFERENCES PRODUCT_DETAILS(`PROD_ID`));"""
cursorObject.execute(create_query)

In [113]:
create_query = """CREATE TABLE rating (`RAT_ID` INT NOT NULL,`CUS_ID` INT NOT NULL,
                    `SUPP_ID` INT NOT NULL,`RAT_RATSTARS` INT NOT NULL,PRIMARY KEY (`RAT_ID`),
                    FOREIGN KEY (`SUPP_ID`) REFERENCES SUPPLIER (`SUPP_ID`),
                    FOREIGN KEY (`CUS_ID`) REFERENCES CUSTOMER(`CUS_ID`));"""
cursorObject.execute(create_query)

In [135]:
insert_query = "INSERT INTO orders (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES (%s, %s, %s, %s, %s)"
val = [(20,1500,"2021-10-12",3,5),
       (25,30500,"2021-09-16",5,2),
       (26,2000,"2021-10-05",1,1),
       (30,3500,"2021-08-16",4,3),
       (50,2000,"2021-10-06",2,1)]


cursorObject.executemany(insert_query, val)
connection.commit()

In [ ]:
insert_query = "INSERT INTO customer (CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER) VALUES (%s, %s, %s, %s, %s)"
val = [(1,"AAKASH",'9999999999',"DELHI",'M'),
(2,"AMAN",'9785463215',"NOIDA",'M'),
(3,"NEHA",'9999999999',"MUMBAI",'F'),
(4,"MEGHA",'9994562399',"KOLKATA",'F'),
(5,"PULKIT",'7895999999',"LUCKNOW",'M')]
cursorObject.executemany(insert_query, val)
connection.commit()

In [139]:
insert_query = "INSERT INTO rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES (%s, %s, %s, %s)"
val = [(1,2,2,4),
(2,3,4,3),
(3,5,1,5),
(4,1,3,2),
(5,4,5,4)]
cursorObject.executemany(insert_query, val)
connection.commit()

In [147]:
import pandas as pd;

In [151]:
#### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.
Query3 = """select customer.cus_gender,count(customer.cus_gender) from customer inner join `orders` on customer.cus_id = orders.cus_id where orders.ord_amount > 3000 group by customer.cus_gender;"""
cursorObject.execute(Query3)
output = cursorObject.fetchall()

## Lets put the output of this query in pandas DataFrame
output_df = pd.DataFrame(output,columns=['CUS_GENDER','COUNT'])

output_df

  CUS_GENDER  COUNT
0          M      1
1          F      1

In [153]:
### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;
Query4 = """select `orders`.*,product.pro_name from `orders`,product_details,product where `orders`.cus_id=2 and `orders`.prod_id=product_details.prod_id and product_details.pro_id = product.pro_id ;"""
cursorObject.execute(Query4)
output = cursorObject.fetchall()

## Lets put the output of this query in pandas DataFrame
output_df = pd.DataFrame(output,columns=['ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID','PRO_NAME'])

output_df

   ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PROD_ID PRO_NAME
0      50        2000  2021-10-06       2        1    GTA V

In [163]:
### Q5) Display the Supplier details who can supply more than one product.
Query5 = """select supplier.* from supplier where supplier.supp_id in (select product_details.supp_id from product_details
group by product_details.supp_id having count(product_details.supp_id)>1) group by supplier.supp_id;;"""
cursorObject.execute(Query5)
output = cursorObject.fetchall();

output_df = pd.DataFrame(output,columns=['SUPP_ID','SUPP_NAME','SUPP_CITY','SUPP_PHONE'])
output_df

   SUPP_ID       SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

In [171]:
### Q6) Find the category of the product whose order amount is minimum.
Query6 = """SELECT category.*,min(`orders`.ord_amount) as min_order_value
FROM category
INNER JOIN product ON category.cat_id = product.cat_id
INNER JOIN product_details ON product.pro_id = product_details.pro_id
INNER JOIN `orders` ON `orders`.prod_id = product_details.prod_id
GROUP BY category.cat_id, category.cat_name;"""
cursorObject.execute(Query6)
output = cursorObject.fetchall();
output_df = pd.DataFrame(output,columns=['CAT_ID','CAT_NAME','ORD_AMT'])
output_df

   CAT_ID     CAT_NAME  ORD_AMT
0       3    GROCERIES     1500
1       4  ELECTRONICS    30500
2       2        GAMES     2000
3       1        BOOKS     3500

In [179]:
### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.
Query7 = """select product.pro_id,product.pro_name,ord.ord_date from product inner join product_details as pd on product.pro_id = pd.pro_id inner join `orders` as ord on pd.prod_id = ord.prod_id where ord.ord_date > "2021-10-05";"""
cursorObject.execute(Query7)
output = cursorObject.fetchall();
output_df = pd.DataFrame(output,columns=['PRO_ID','PROD_NAME','ORD_DATE'])
output_df

   PRO_ID PROD_NAME    ORD_DATE
0       4      OATS  2021-10-12
1       1     GTA V  2021-10-06

In [181]:
### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.
Query8 = """select supplier.supp_id,supplier.supp_name,rating.rat_ratstars,customer.cus_name from supplier inner join rating on rating.supp_id = supplier.supp_id inner join customer on customer.cus_id = rating.cus_id order by rating.rat_ratstars desc limit 3;"""
cursorObject.execute(Query8)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output,columns=['SUPP_ID','SUPP_NAME','RATING','CUS_NAME'])
output_df

   SUPP_ID       SUPP_NAME  RATING CUS_NAME
0        1  Rajesh Retails       5   PULKIT
1        2    Appario Ltd.       4     AMAN
2        5     Mittal Ltd.       4    MEGHA

In [183]:
### Q9) Display customer name and gender whose names start or end with character 'A'.
Query9 = """select customer.cus_name,customer.cus_gender from customer where customer.cus_name like 'A%' or customer.cus_name like '%A';"""
cursorObject.execute(Query9)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output,columns = ['CUS_NAME','CUS_GENDER'])
output_df

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

In [185]:
### Q10) Display the total order amount of the male customers.
Query10 = """select sum(ord.ord_amount) as AMOUNT from `orders` as ord inner join customer on ord.cus_id = customer.cus_id where customer.cus_gender = 'M';"""
cursorObject.execute(Query10)
output = cursorObject.fetchall();
print("Amount is",output)

Amount is [(Decimal('34500'),)]

In [193]:
### Q11) Display all the Customers left outer join with  the orders
Query11 = """select * from customer left outer join `orders` on customer.cus_id = `orders`.cus_id;"""
cursorObject.execute(Query11)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output,columns = ['CUS_ID','CUS_NAME','CUS_PHONE','CUS_CITY','CUS_GENDER','ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID'])
output_df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID
0,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,2,1
2,3,NEHA,9999999999,MUMBAI,F,20,1500,2021-10-12,3,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,4,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,5,2